org/rust/rust学习笔记.org
#+TITLE: rust学习笔记
* 书籍
https://rustcc.gitbooks.io/rustprimer/content/
* install
1. =curl https://sh.rustup.rs -sSf | sh=
2. =rustup toolchain add nightly=
3. =cargo +nightly install racer=
4. =git clone https://github.com/rust-lang/rust.git ~/.rust=
5. ~export RUST_SRC_PATH\="/path/to/rust/src"~
* emacs配置
#+BEGIN_SRC elisp
(use-package rust-mode :ensure t :defer t
  :config
  (use-package racer :ensure t
    :config
    (setq racer-cmd "/Users/qinxiaoguang01/.cargo/bin/racer")
    (setq racer-rust-src-path "/Users/qinxiaoguang01/.rust/src"))
  (use-package company-racer :ensure t
    :config
    (setq company-racer-executable "/Users/qinxiaoguang01/.cargo/bin/racer"))
  (use-package flycheck-rust :ensure t)
  (add-to-list 'auto-mode-alist '("\\.rs\\'" . rust-mode))
  (add-hook 'rust-mode-hook
            '(lambda ()
               ;; Enable racer
               (racer-activate)
               ;; Hook in racer with eldoc to provide documentation
               (racer-turn-on-eldoc)
               ;; Use flycheck-rust in rust-mode
               (add-hook 'flycheck-mode-hook #'flycheck-rust-setup)
               ;; Use company-racer in rust mode
               (set (make-local-variable 'company-backends) '(company-racer))
               ;; Key binding to jump to method definition
               (local-set-key (kbd "M-.") #'racer-find-definition)
               ;; Key binding to auto complete and indent
               (local-set-key (kbd "TAB") #'racer-complete-or-indent))))

#+END_SRC
* Hello world
#+BEGIN_SRC rust
fn main(){
    println!("hello world");
}
#+END_SRC
编译: =rustc file.rs= 
运行: =./file= 
* Hello Rust
- 创建项目 =cargo new hellorust --bin= 
- 项目目录
#+BEGIN_VERSE
.
├── Cargo.toml
└── src
    └── main.rs
#+END_VERSE
- 编译 =cargo build= ,优化编译 =cargo build --release= 
- 运行 =./target/debug/hellorust= 
- 编译并运行: =cargo run= or =cargo run --release= 
* 变量
#+BEGIN_SRC rust
    //varable
    let a1 = 5; // int32类型，rust会做类型推断, 没有mut关键字，都是不可变变量
    //a1 = 6 ; 不可变变量，若改变其值会报错
    let a2:i32 = 5; // int32类型,注: rust中的变量名都很短
    let b1:u32 = 5; // unsign int32类型

    let mut a11:f64 = 1.0; // 可变变量
    a11 = 2.0; // 不会报错
    let a11 = a11; // 可重新绑定为不可变
    let b12 = 1.2f32; // rust中的value + type写法

    let (a, mut b):(bool, bool) = (true, false); // 多个变量赋值
#+END_SRC
