rust/rust学习笔记.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-17 Wed 17:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>rust学习笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="qxg" />
<link rel="shortcut icon" type="image/x-icon" href="/static/img/favicon.ico">
<link rel="stylesheet" type="text/css" href="/static/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/static/css/readtheorg.css"/><link rel="stylesheet" type="text/css" href="/static/css/orgstyle.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/index.html"> UP </a>
 |
 <a accesskey="H" href="/index.html"> HOME </a>
</div><div id="content">
<h1 class="title">rust学习笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org24f8dc1">书籍</a></li>
<li><a href="#orgdcf49f1">install</a></li>
<li><a href="#org28b213b">emacs配置</a></li>
<li><a href="#org6b052e2">Hello world</a></li>
<li><a href="#org9811429">Hello Rust</a></li>
<li><a href="#orgd069b86">变量</a></li>
<li><a href="#org2f19f6e">类型</a></li>
<li><a href="#orgce289f6">控制流</a>
<ul>
<li><a href="#org6c7c7e3">if</a></li>
<li><a href="#org0c0c6d9">for</a></li>
<li><a href="#org13187a8">while</a></li>
<li><a href="#orgbeea5f2">match</a></li>
</ul>
</li>
<li><a href="#org575fe24">函数</a></li>
<li><a href="#orgad713e8">trait</a></li>
<li><a href="#org5198671">cargo</a>
<ul>
<li><a href="#org6b43412">cargo.toml和cargo.lock</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org24f8dc1" class="outline-2">
<h2 id="org24f8dc1">书籍</h2>
<div class="outline-text-2" id="text-org24f8dc1">
<p>
<a href="https://rustcc.gitbooks.io/rustprimer/content/">https://rustcc.gitbooks.io/rustprimer/content/</a>
</p>
</div>
</div>
<div id="outline-container-orgdcf49f1" class="outline-2">
<h2 id="orgdcf49f1">install</h2>
<div class="outline-text-2" id="text-orgdcf49f1">
<ol class="org-ol">
<li><code>curl https://sh.rustup.rs -sSf | sh</code></li>
<li><code>rustup toolchain add nightly</code></li>
<li><code>cargo +nightly install racer</code></li>
<li><code>git clone https://github.com/rust-lang/rust.git ~/.rust</code></li>
<li><code>export RUST_SRC_PATH\="/path/to/rust/src"</code></li>
</ol>
</div>
</div>
<div id="outline-container-org28b213b" class="outline-2">
<h2 id="org28b213b">emacs配置</h2>
<div class="outline-text-2" id="text-org28b213b">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #F92672;">use-package</span> <span style="color: #AE81FF;">rust-mode</span> <span style="color: #F92672;">:ensure</span> t <span style="color: #F92672;">:defer</span> t
  <span style="color: #F92672;">:config</span>
  (<span style="color: #F92672;">use-package</span> <span style="color: #AE81FF;">racer</span> <span style="color: #F92672;">:ensure</span> t
    <span style="color: #F92672;">:config</span>
    (<span style="color: #F92672;">setq</span> racer-cmd <span style="color: #E6DB74;">"/Users/qinxiaoguang01/.cargo/bin/racer"</span>)
    (<span style="color: #F92672;">setq</span> racer-rust-src-path <span style="color: #E6DB74;">"/Users/qinxiaoguang01/.rust/src"</span>))
  (<span style="color: #F92672;">use-package</span> <span style="color: #AE81FF;">company-racer</span> <span style="color: #F92672;">:ensure</span> t
    <span style="color: #F92672;">:config</span>
    (<span style="color: #F92672;">setq</span> company-racer-executable <span style="color: #E6DB74;">"/Users/qinxiaoguang01/.cargo/bin/racer"</span>))
  (<span style="color: #F92672;">use-package</span> <span style="color: #AE81FF;">flycheck-rust</span> <span style="color: #F92672;">:ensure</span> t)
  (add-to-list 'auto-mode-alist '(<span style="color: #E6DB74;">"\\.rs\\'"</span> . rust-mode))
  (add-hook 'rust-mode-hook
            '(lambda ()
               <span style="color: #75715E;">;; </span><span style="color: #75715E;">Enable racer</span>
               (racer-activate)
               <span style="color: #75715E;">;; </span><span style="color: #75715E;">Hook in racer with eldoc to provide documentation</span>
               (racer-turn-on-eldoc)
               <span style="color: #75715E;">;; </span><span style="color: #75715E;">Use flycheck-rust in rust-mode</span>
               (add-hook 'flycheck-mode-hook #'flycheck-rust-setup)
               <span style="color: #75715E;">;; </span><span style="color: #75715E;">Use company-racer in rust mode</span>
               (set (make-local-variable 'company-backends) '(company-racer))
               <span style="color: #75715E;">;; </span><span style="color: #75715E;">Key binding to jump to method definition</span>
               (local-set-key (kbd <span style="color: #E6DB74;">"M-."</span>) #'racer-find-definition)
               <span style="color: #75715E;">;; </span><span style="color: #75715E;">Key binding to auto complete and indent</span>
               (local-set-key (kbd <span style="color: #E6DB74;">"TAB"</span>) #'racer-complete-or-indent))))

</pre>
</div>
</div>
</div>
<div id="outline-container-org6b052e2" class="outline-2">
<h2 id="org6b052e2">Hello world</h2>
<div class="outline-text-2" id="text-org6b052e2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #F92672;">fn</span> <span style="color: #A6E22E;">main</span>(){
    <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"hello world"</span>);
}
</pre>
</div>
<p>
编译: <code>rustc file.rs</code> 
运行: <code>./file</code> 
</p>
</div>
</div>
<div id="outline-container-org9811429" class="outline-2">
<h2 id="org9811429">Hello Rust</h2>
<div class="outline-text-2" id="text-org9811429">
<ul class="org-ul">
<li>创建项目 <code>cargo new hellorust --bin</code></li>
<li>项目目录</li>
</ul>
<p class="verse">
.<br />
├── Cargo.toml<br />
└── src<br />
&#xa0;&#xa0;&#xa0;&#xa0;└── main.rs<br />
</p>
<ul class="org-ul">
<li>编译 <code>cargo build</code> ,优化编译 <code>cargo build --release</code></li>
<li>运行 <code>./target/debug/hellorust</code></li>
<li>编译并运行: <code>cargo run</code> or <code>cargo run --release</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgd069b86" class="outline-2">
<h2 id="orgd069b86">变量</h2>
<div class="outline-text-2" id="text-orgd069b86">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #75715E;">//</span><span style="color: #75715E;">varable</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">a1</span> = 5; <span style="color: #75715E;">// </span><span style="color: #75715E;">int32&#31867;&#22411;&#65292;rust&#20250;&#20570;&#31867;&#22411;&#25512;&#26029;, &#27809;&#26377;mut&#20851;&#38190;&#23383;&#65292;&#37117;&#26159;&#19981;&#21487;&#21464;&#21464;&#37327;</span>
<span style="color: #75715E;">//</span><span style="color: #75715E;">a1 = 6 ; &#19981;&#21487;&#21464;&#21464;&#37327;&#65292;&#33509;&#25913;&#21464;&#20854;&#20540;&#20250;&#25253;&#38169;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">a2</span>:<span style="color: #66D9EF;">i32</span> = 5; <span style="color: #75715E;">// </span><span style="color: #75715E;">int32&#31867;&#22411;,&#27880;: rust&#20013;&#30340;&#21464;&#37327;&#21517;&#37117;&#24456;&#30701;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">b1</span>:<span style="color: #66D9EF;">u32</span> = 5; <span style="color: #75715E;">// </span><span style="color: #75715E;">unsign int32&#31867;&#22411;</span>

<span style="color: #F92672;">let</span> <span style="color: #F92672;">mut</span> <span style="color: #FD971F;">a11</span>:<span style="color: #66D9EF;">f64</span> = 1.0; <span style="color: #75715E;">// </span><span style="color: #75715E;">&#21487;&#21464;&#21464;&#37327;</span>
a11 = 2.0; <span style="color: #75715E;">// </span><span style="color: #75715E;">&#19981;&#20250;&#25253;&#38169;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">a11</span> = a11; <span style="color: #75715E;">// </span><span style="color: #75715E;">&#21487;&#37325;&#26032;&#32465;&#23450;&#20026;&#19981;&#21487;&#21464;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">b12</span> = 1.2f32; <span style="color: #75715E;">// </span><span style="color: #75715E;">rust&#20013;&#30340;value + type&#20889;&#27861;</span>

<span style="color: #F92672;">let</span> (a, <span style="color: #F92672;">mut</span> b):(<span style="color: #66D9EF;">bool</span>, <span style="color: #66D9EF;">bool</span>) = (<span style="color: #F92672;">true</span>, <span style="color: #F92672;">false</span>); <span style="color: #75715E;">// </span><span style="color: #75715E;">&#22810;&#20010;&#21464;&#37327;&#36171;&#20540;</span>
</pre>
</div>
</div>
</div>
