org/rust/rust学习笔记.org
* 类型
- 布尔类型：有两个值true和false。
- 字符类型：表示单个Unicode字符，存储为4个字节。可将来任何字符赋值, 如 ~let c='秦'~ 
- 数值类型：分为有符号整数 (i8, i16, i32, i64, isize)、 无符号整数 (u8, u16, u32, u64, usize) 以及浮点数 (f32, f64)。其中iszie,usize则是自适应类型，其大小取决于操作系统。
- 字符串类型：最底层的是不定长类型str，更常用的是字符串切片&str和堆分配字符串String， 其中字符串切片是静态分配的，有固定的大小，并且不可变，而堆分配字符串是可变的。
  #+BEGIN_SRC rust
 let hello = "hello world"; // 双引号中的字符串类型为&'static str, 即其不可变
 let hello : &'static str = "hello world"; // 两种方式等价

 // String 类型，类比[T]和Vec<T>的关系，str和String就是这种关系
 let mut s = String::new();
 let mut hello = String::from("hello");
 hello.push('w'); // 压入字符
 hello.push_str("orld"); // 压入字符串
 hello.pop(); // 弹出

// str转String
let x:&'static str="hello";
let mut y:String = x.to_string();
// String 转str
let s = "Hello".to_string();
let ss = &*s;

// 可使用r来避免字符串转义
let d &'static str = r"abc/nabc";

// 下标访问
let c="hello".to_string();
c.chars().nth(2); // 访问第2个 

// 字符串切片，很危险，不建议使用
  #+END_SRC
- 数组：具有固定大小，并且元素都是同种类型，可表示为[T; N]。
  #+BEGIN_SRC rust
    let array : [i32; 3] = [0; 3]; // 数组大小是固定的，[T; N]用来表示数组N个T类型,[0;3]表示3个0构成的数组
    for x in &array {
        println!("{}", x)
    }

    // vector
    let v:Vec<i32> = Vec::new(); // 空vector, 不可变，不可压入数据
    let v:Vec<i32> = Vec![]; // 宏创建
    let v = Vec![1,2,3,4,5];
    let v = vec![0;10];
    let mut v = vec![1,2]; // 可变vector,可压入数据
    v.push(3); // 压入数据
    let res = v.pop(); // 弹出数据
  #+END_SRC
- 切片：引用一个数组的部分数据并且不需要拷贝，可表示为&[T]。&符号不要考虑成引用，会给自己增加负担，相反，应考虑为切片的必要的一部分。
  #+BEGIN_SRC rust
let arr = [1,2,3,4,5];
let slice_1 = &arr[..]; // 获取全部元素
let slice_2 = &arr[1..4]; // 获取下标[1,4]的元素
let slice_3 = &arr[1..]; // 获取下标1之后的所有元素
let slice_4 = &arr[..3]; // 获取下标3之前的所有元素

// 有关slice的函数
fn show(arr: &[u8]){
    for i in arr {
        print!("{} ",i);
    }
}
// 调用
show(&arr[..]);
show(slice_1);
#+END_SRC
- 元组：具有固定大小的有序列表，每个元素都有自己的类型，通过解构或者索引来获得每个元素的值。
  #+BEGIN_SRC rust
let y = (0, "1234");
let x :(i32, &str) = (3, "123456")
// 访问
let (w, z) = y;
// 下标访问
let f = x.0;
let e = x.1;
  #+END_SRC
- 指针：最底层的是裸指针*const T和*mut T，但解引用它们是不安全的，必须放到unsafe块里。
- 函数：具有函数类型的变量实质上是一个函数指针。
- 元类型：即()，其唯一的值也是()。
- 结构体
  #+BEGIN_SRC rust
// 1. 通常驼峰命名
// 2. 结构体的中的值默认不可变,且不支持域类型为可变,可通过Cell来模拟
// 3. 结构体域的结尾是逗号,
// 4. 结构体的域默认私有, 可通过pub关键字公开
struct Point{
    x:i32,
    y:i32,
}

// 1. 元组结构体,用()来包裹域,且域无名字
// 2. 通常驼峰命名
// 3. 元组结构体的构造方法可被当做函数传入
struct Color(u8,u8,u8);
// 4. 若元组结构体只有一个域，则其为newtype
struct NewInt(i32);
// 5. 空结构体占用空间为0
struct D;

fn main() {
    let point = Point{x:1, y:2};
    let point2 = Point{..point}; // .. 表达式可以表示copy
    let point3 = Point{x:2,..point}; // .. 表达式可以表示copy
    println!("{}",point.y)
}
  #+END_SRC
* 控制流
