rust/rust学习笔记.html
<div id="outline-container-org2f19f6e" class="outline-2">
<h2 id="org2f19f6e">类型</h2>
<div class="outline-text-2" id="text-org2f19f6e">
<ul class="org-ul">
<li>布尔类型：有两个值true和false。</li>
<li>字符类型：表示单个Unicode字符，存储为4个字节。可将来任何字符赋值, 如 <code>let c='秦'</code></li>
<li>数值类型：分为有符号整数 (i8, i16, i32, i64, isize)、 无符号整数 (u8, u16, u32, u64, usize) 以及浮点数 (f32, f64)。其中iszie,usize则是自适应类型，其大小取决于操作系统。</li>
<li><p>
字符串类型：最底层的是不定长类型str，更常用的是字符串切片&amp;str和堆分配字符串String， 其中字符串切片是静态分配的，有固定的大小，并且不可变，而堆分配字符串是可变的。
</p>
<div class="org-src-container">
<pre class="src src-rust"> <span style="color: #F92672;">let</span> <span style="color: #FD971F;">hello</span> = <span style="color: #E6DB74;">"hello world"</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">&#21452;&#24341;&#21495;&#20013;&#30340;&#23383;&#31526;&#20018;&#31867;&#22411;&#20026;&amp;'static str, &#21363;&#20854;&#19981;&#21487;&#21464;</span>
 <span style="color: #F92672;">let</span> <span style="color: #FD971F;">hello</span> : &amp;'<span style="color: #F92672;">static</span> <span style="color: #66D9EF;">str</span> = <span style="color: #E6DB74;">"hello world"</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">&#20004;&#31181;&#26041;&#24335;&#31561;&#20215;</span>

 <span style="color: #75715E;">// </span><span style="color: #75715E;">String &#31867;&#22411;&#65292;&#31867;&#27604;[T]&#21644;Vec&lt;T&gt;&#30340;&#20851;&#31995;&#65292;str&#21644;String&#23601;&#26159;&#36825;&#31181;&#20851;&#31995;</span>
 <span style="color: #F92672;">let</span> <span style="color: #F92672;">mut</span> <span style="color: #FD971F;">s</span> = <span style="color: #66D9EF;">String</span>::new();
 <span style="color: #F92672;">let</span> <span style="color: #F92672;">mut</span> <span style="color: #FD971F;">hello</span> = <span style="color: #66D9EF;">String</span>::from(<span style="color: #E6DB74;">"hello"</span>);
 hello.push(<span style="color: #E6DB74;">'w'</span>); <span style="color: #75715E;">// </span><span style="color: #75715E;">&#21387;&#20837;&#23383;&#31526;</span>
 hello.push_str(<span style="color: #E6DB74;">"orld"</span>); <span style="color: #75715E;">// </span><span style="color: #75715E;">&#21387;&#20837;&#23383;&#31526;&#20018;</span>
 hello.pop(); <span style="color: #75715E;">// </span><span style="color: #75715E;">&#24377;&#20986;</span>

<span style="color: #75715E;">// </span><span style="color: #75715E;">str&#36716;String</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">x</span>:&amp;'<span style="color: #F92672;">static</span> str=<span style="color: #E6DB74;">"hello"</span>;
<span style="color: #F92672;">let</span> <span style="color: #F92672;">mut</span> <span style="color: #FD971F;">y</span>:<span style="color: #66D9EF;">String</span> = x.to_string();
<span style="color: #75715E;">// </span><span style="color: #75715E;">String &#36716;str</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">s</span> = <span style="color: #E6DB74;">"Hello"</span>.to_string();
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">ss</span> = &amp;*s;

<span style="color: #75715E;">// </span><span style="color: #75715E;">&#21487;&#20351;&#29992;r&#26469;&#36991;&#20813;&#23383;&#31526;&#20018;&#36716;&#20041;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">d</span> &amp;'<span style="color: #F92672;">static</span> <span style="color: #66D9EF;">str</span> = <span style="color: #E6DB74;">r"abc/nabc"</span>;

<span style="color: #75715E;">// </span><span style="color: #75715E;">&#19979;&#26631;&#35775;&#38382;</span>
<span style="color: #F92672;">let</span> c=<span style="color: #E6DB74;">"hello"</span>.to_string();
c.chars().nth(2); <span style="color: #75715E;">// </span><span style="color: #75715E;">&#35775;&#38382;&#31532;2&#20010; </span>

<span style="color: #75715E;">// </span><span style="color: #75715E;">&#23383;&#31526;&#20018;&#20999;&#29255;&#65292;&#24456;&#21361;&#38505;&#65292;&#19981;&#24314;&#35758;&#20351;&#29992;</span>
</pre>
</div></li>
<li><p>
数组：具有固定大小，并且元素都是同种类型，可表示为[T; N]。
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #F92672;">let</span> <span style="color: #FD971F;">array</span> : [<span style="color: #66D9EF;">i32</span>; 3] = [0; 3]; <span style="color: #75715E;">// </span><span style="color: #75715E;">&#25968;&#32452;&#22823;&#23567;&#26159;&#22266;&#23450;&#30340;&#65292;[T; N]&#29992;&#26469;&#34920;&#31034;&#25968;&#32452;N&#20010;T&#31867;&#22411;,[0;3]&#34920;&#31034;3&#20010;0&#26500;&#25104;&#30340;&#25968;&#32452;</span>
<span style="color: #F92672;">for</span> x <span style="color: #F92672;">in</span> &amp;array {
    <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"</span><span style="color: #E6DB74; font-style: italic;">{}</span><span style="color: #E6DB74;">"</span>, x)
}

<span style="color: #75715E;">// </span><span style="color: #75715E;">vector</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">v</span>:<span style="color: #66D9EF;">Vec</span>&lt;<span style="color: #66D9EF;">i32</span>&gt; = <span style="color: #66D9EF;">Vec</span>::new(); <span style="color: #75715E;">// </span><span style="color: #75715E;">&#31354;vector, &#19981;&#21487;&#21464;&#65292;&#19981;&#21487;&#21387;&#20837;&#25968;&#25454;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">v</span>:<span style="color: #66D9EF;">Vec</span>&lt;<span style="color: #66D9EF;">i32</span>&gt; = <span style="color: #F92672;">Vec!</span>[]; <span style="color: #75715E;">// </span><span style="color: #75715E;">&#23439;&#21019;&#24314;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">v</span> = <span style="color: #F92672;">Vec!</span>[1,2,3,4,5];
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">v</span> = <span style="color: #F92672;">vec!</span>[0;10];
<span style="color: #F92672;">let</span> <span style="color: #F92672;">mut</span> <span style="color: #FD971F;">v</span> = <span style="color: #F92672;">vec!</span>[1,2]; <span style="color: #75715E;">// </span><span style="color: #75715E;">&#21487;&#21464;vector,&#21487;&#21387;&#20837;&#25968;&#25454;</span>
v.push(3); <span style="color: #75715E;">// </span><span style="color: #75715E;">&#21387;&#20837;&#25968;&#25454;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">res</span> = v.pop(); <span style="color: #75715E;">// </span><span style="color: #75715E;">&#24377;&#20986;&#25968;&#25454;</span>
</pre>
</div></li>
<li><p>
切片：引用一个数组的部分数据并且不需要拷贝，可表示为&amp;[T]。&amp;符号不要考虑成引用，会给自己增加负担，相反，应考虑为切片的必要的一部分。
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #F92672;">let</span> <span style="color: #FD971F;">arr</span> = [1,2,3,4,5];
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">slice_1</span> = &amp;arr[..]; <span style="color: #75715E;">// </span><span style="color: #75715E;">&#33719;&#21462;&#20840;&#37096;&#20803;&#32032;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">slice_2</span> = &amp;arr[1..4]; <span style="color: #75715E;">// </span><span style="color: #75715E;">&#33719;&#21462;&#19979;&#26631;[1,4]&#30340;&#20803;&#32032;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">slice_3</span> = &amp;arr[1..]; <span style="color: #75715E;">// </span><span style="color: #75715E;">&#33719;&#21462;&#19979;&#26631;1&#20043;&#21518;&#30340;&#25152;&#26377;&#20803;&#32032;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">slice_4</span> = &amp;arr[..3]; <span style="color: #75715E;">// </span><span style="color: #75715E;">&#33719;&#21462;&#19979;&#26631;3&#20043;&#21069;&#30340;&#25152;&#26377;&#20803;&#32032;</span>

<span style="color: #75715E;">// </span><span style="color: #75715E;">&#26377;&#20851;slice&#30340;&#20989;&#25968;</span>
<span style="color: #F92672;">fn</span> <span style="color: #A6E22E;">show</span>(<span style="color: #FD971F;">arr</span>: &amp;[<span style="color: #66D9EF;">u8</span>]){
    <span style="color: #F92672;">for</span> i <span style="color: #F92672;">in</span> arr {
        <span style="color: #F92672;">print!</span>(<span style="color: #E6DB74;">"</span><span style="color: #E6DB74; font-style: italic;">{}</span><span style="color: #E6DB74;"> "</span>,i);
    }
}
<span style="color: #75715E;">// </span><span style="color: #75715E;">&#35843;&#29992;</span>
show(&amp;arr[..]);
show(slice_1);
</pre>
</div></li>
<li><p>
元组：具有固定大小的有序列表，每个元素都有自己的类型，通过解构或者索引来获得每个元素的值。
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #F92672;">let</span> <span style="color: #FD971F;">y</span> = (0, <span style="color: #E6DB74;">"1234"</span>);
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">x</span> :(<span style="color: #66D9EF;">i32</span>, &amp;<span style="color: #66D9EF;">str</span>) = (3, <span style="color: #E6DB74;">"123456"</span>)
<span style="color: #75715E;">// </span><span style="color: #75715E;">&#35775;&#38382;</span>
<span style="color: #F92672;">let</span> (w, z) = y;
<span style="color: #75715E;">// </span><span style="color: #75715E;">&#19979;&#26631;&#35775;&#38382;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">f</span> = x.0;
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">e</span> = x.1;
</pre>
</div></li>
<li>指针：最底层的是裸指针*const T和*mut T，但解引用它们是不安全的，必须放到unsafe块里。</li>
<li>函数：具有函数类型的变量实质上是一个函数指针。</li>
<li>元类型：即()，其唯一的值也是()。</li>
<li><p>
结构体
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #75715E;">// </span><span style="color: #75715E;">1. &#36890;&#24120;&#39548;&#23792;&#21629;&#21517;</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">2. &#32467;&#26500;&#20307;&#30340;&#20013;&#30340;&#20540;&#40664;&#35748;&#19981;&#21487;&#21464;,&#19988;&#19981;&#25903;&#25345;&#22495;&#31867;&#22411;&#20026;&#21487;&#21464;,&#21487;&#36890;&#36807;Cell&#26469;&#27169;&#25311;</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">3. &#32467;&#26500;&#20307;&#22495;&#30340;&#32467;&#23614;&#26159;&#36887;&#21495;,</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">4. &#32467;&#26500;&#20307;&#30340;&#22495;&#40664;&#35748;&#31169;&#26377;, &#21487;&#36890;&#36807;pub&#20851;&#38190;&#23383;&#20844;&#24320;</span>
<span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">Point</span>{
    <span style="color: #FD971F;">x</span>:<span style="color: #66D9EF;">i32</span>,
    <span style="color: #FD971F;">y</span>:<span style="color: #66D9EF;">i32</span>,
}

<span style="color: #75715E;">// </span><span style="color: #75715E;">1. &#20803;&#32452;&#32467;&#26500;&#20307;,&#29992;()&#26469;&#21253;&#35065;&#22495;,&#19988;&#22495;&#26080;&#21517;&#23383;</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">2. &#36890;&#24120;&#39548;&#23792;&#21629;&#21517;</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">3. &#20803;&#32452;&#32467;&#26500;&#20307;&#30340;&#26500;&#36896;&#26041;&#27861;&#21487;&#34987;&#24403;&#20570;&#20989;&#25968;&#20256;&#20837;</span>
<span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">Color</span>(<span style="color: #66D9EF;">u8</span>,<span style="color: #66D9EF;">u8</span>,<span style="color: #66D9EF;">u8</span>);
<span style="color: #75715E;">// </span><span style="color: #75715E;">4. &#33509;&#20803;&#32452;&#32467;&#26500;&#20307;&#21482;&#26377;&#19968;&#20010;&#22495;&#65292;&#21017;&#20854;&#20026;newtype</span>
<span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">NewInt</span>(<span style="color: #66D9EF;">i32</span>);
<span style="color: #75715E;">// </span><span style="color: #75715E;">5. &#31354;&#32467;&#26500;&#20307;&#21344;&#29992;&#31354;&#38388;&#20026;0</span>
<span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">D</span>;

<span style="color: #F92672;">fn</span> <span style="color: #A6E22E;">main</span>() {
    <span style="color: #F92672;">let</span> <span style="color: #FD971F;">point</span> = <span style="color: #66D9EF;">Point</span>{<span style="color: #FD971F;">x</span>:1, <span style="color: #FD971F;">y</span>:2};
    <span style="color: #F92672;">let</span> <span style="color: #FD971F;">point2</span> = <span style="color: #66D9EF;">Point</span>{..point}; <span style="color: #75715E;">// </span><span style="color: #75715E;">.. &#34920;&#36798;&#24335;&#21487;&#20197;&#34920;&#31034;copy</span>
    <span style="color: #F92672;">let</span> <span style="color: #FD971F;">point3</span> = <span style="color: #66D9EF;">Point</span>{<span style="color: #FD971F;">x</span>:2,..point}; <span style="color: #75715E;">// </span><span style="color: #75715E;">.. &#34920;&#36798;&#24335;&#21487;&#20197;&#34920;&#31034;copy</span>
    <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"</span><span style="color: #E6DB74; font-style: italic;">{}</span><span style="color: #E6DB74;">"</span>,point.y)
}
</pre>
</div></li>
</ul>
</div>
</div>
