org/rust/rust学习笔记.org
** if
#+BEGIN_SRC rust
// 形式1 
if expr1 {

}

// 形式2
if expr1 {

} else if expr2 {

} else

// 形式3
if expr1 {

} else {

}

// rust 中if是一个表达式,so可以这么写
let x = 5;
let y = if x == 5 {10} else {15};
// rust基于表达式的语言，有且仅有两种语句，1. 声明语句:如let, 2. 表达式语句,在表达式后加';',将表达式变成语句。
// 以;结尾的为语句,语句的返回值为unit (),如 x=5 是一条表达式，而x=5; 是一条语句

// if let是match的简化用法
let x = Some(5);
if let Some(y) = x{
    println!("{}", y);
}
let z = if let Some(y) = x {y} else {0}; // 若x中有值，则赋给z
#+END_SRC
** for
#+BEGIN_SRC rust
// expression 是一个迭代器,如0..10,or [0,1,2].iter()
for var in iterator {

}
eg :
for x in 0..10 {

}

// 获取索引，使用enumerate()函数
for (i,j) in (0..10).enumerate() {
    println!("i is {}, j is {}", i, j);
}
#+END_SRC
** while
#+BEGIN_SRC rust
// expr是一个bool的表达式
while expr{

}

// loop类似 while true
loop {

}
#+END_SRC
** match
#+BEGIN_SRC rust
    // match 类比switch,需符合一下要求
    // 1. 语句以,结尾
    // 2. 若要获取匹配值，使用@符号,通常用于模式匹配中
    // 3. 必须要有_符合来穷举剩余匹配，因rust要求覆盖所有可能
    let mut cnt = 0;
    match cnt {
        0|6 => println!("ha"),
        e @ 1 ... 5 => println!("hei"),
        _ => println!("huhu"),
    }
    // 4. 可通过ref关键字得到某值的引用
    match cnt {
        ref r => println!("got a ref {}", r),
    }
    // 5. 可模糊匹配元组
    let pair = (0, -2);
    match pair {
        (0, y) => println!("y is {:?}", y),
        (x, 0) => println!("x is {:?}", x),
        _ => println!("doesnt match anything"),
    }
    // 6. 可匹配结构体,及枚举
    let origin = Point {x:0, y:0};
    match origin {
        Point{x, ..} => println!("x is {}", x),
    }
    // 也可对struct中的域进行重命名
    match origin {
        Point{x:x1, y:y1} => println!("x is", x1),
    }
    // 7. 除了panic,所有分支的表达式的结果必须相同
    // 后置条件
    let y = false;
    match x {
        4|5 if y => println!("yes"), // 其实就是 (x in 4|5) && (if y)
        _ => println!("no"),
    }
    // 其实上述内容和haskell中的模式匹配基本一样
    // 也可通过let和while进行模式匹配
    let number = Some(7);
    if let Some(i) = number {
        println!("i is {}", i);
    } else {
        println!("doesnt match a number");
    }
    // while let
    while let Some(i) = number {
        if i > 5 {
            println!("i is gt 5");
            break;
        } else {
            println!("i is small than t");
        }
    }
#+END_SRC
