rust/rust学习笔记.html
<div id="outline-container-orgce289f6" class="outline-2">
<h2 id="orgce289f6">控制流</h2>
<div class="outline-text-2" id="text-orgce289f6">
</div>
<div id="outline-container-org6c7c7e3" class="outline-3">
<h3 id="org6c7c7e3">if</h3>
<div class="outline-text-3" id="text-org6c7c7e3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #75715E;">// </span><span style="color: #75715E;">&#24418;&#24335;1 </span>
<span style="color: #F92672;">if</span> expr1 {

}

<span style="color: #75715E;">// </span><span style="color: #75715E;">&#24418;&#24335;2</span>
<span style="color: #F92672;">if</span> expr1 {

} <span style="color: #F92672;">else</span> <span style="color: #F92672;">if</span> expr2 {

} <span style="color: #F92672;">else</span>

<span style="color: #75715E;">// </span><span style="color: #75715E;">&#24418;&#24335;3</span>
<span style="color: #F92672;">if</span> expr1 {

} <span style="color: #F92672;">else</span> {

}

<span style="color: #75715E;">// </span><span style="color: #75715E;">rust &#20013;if&#26159;&#19968;&#20010;&#34920;&#36798;&#24335;,so&#21487;&#20197;&#36825;&#20040;&#20889;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">x</span> = 5;
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">y</span> = <span style="color: #F92672;">if</span> x == 5 {10} <span style="color: #F92672;">else</span> {15};
<span style="color: #75715E;">// </span><span style="color: #75715E;">rust&#22522;&#20110;&#34920;&#36798;&#24335;&#30340;&#35821;&#35328;&#65292;&#26377;&#19988;&#20165;&#26377;&#20004;&#31181;&#35821;&#21477;&#65292;1. &#22768;&#26126;&#35821;&#21477;:&#22914;let, 2. &#34920;&#36798;&#24335;&#35821;&#21477;,&#22312;&#34920;&#36798;&#24335;&#21518;&#21152;';',&#23558;&#34920;&#36798;&#24335;&#21464;&#25104;&#35821;&#21477;&#12290;</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">&#20197;;&#32467;&#23614;&#30340;&#20026;&#35821;&#21477;,&#35821;&#21477;&#30340;&#36820;&#22238;&#20540;&#20026;unit (),&#22914; x=5 &#26159;&#19968;&#26465;&#34920;&#36798;&#24335;&#65292;&#32780;x=5; &#26159;&#19968;&#26465;&#35821;&#21477;</span>

<span style="color: #75715E;">// </span><span style="color: #75715E;">if let&#26159;match&#30340;&#31616;&#21270;&#29992;&#27861;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">x</span> = <span style="color: #66D9EF;">Some</span>(5);
<span style="color: #F92672;">if</span> <span style="color: #F92672;">let</span> <span style="color: #66D9EF;">Some</span>(y) = x{
    <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"</span><span style="color: #E6DB74; font-style: italic;">{}</span><span style="color: #E6DB74;">"</span>, y);
}
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">z</span> = <span style="color: #F92672;">if</span> <span style="color: #F92672;">let</span> <span style="color: #66D9EF;">Some</span>(y) = x {y} <span style="color: #F92672;">else</span> {0}; <span style="color: #75715E;">// </span><span style="color: #75715E;">&#33509;x&#20013;&#26377;&#20540;&#65292;&#21017;&#36171;&#32473;z</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0c0c6d9" class="outline-3">
<h3 id="org0c0c6d9">for</h3>
<div class="outline-text-3" id="text-org0c0c6d9">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #75715E;">// </span><span style="color: #75715E;">expression &#26159;&#19968;&#20010;&#36845;&#20195;&#22120;,&#22914;0..10,or [0,1,2].iter()</span>
<span style="color: #F92672;">for</span> var <span style="color: #F92672;">in</span> iterator {

}
eg :
<span style="color: #F92672;">for</span> x <span style="color: #F92672;">in</span> 0..10 {

}

<span style="color: #75715E;">// </span><span style="color: #75715E;">&#33719;&#21462;&#32034;&#24341;&#65292;&#20351;&#29992;enumerate()&#20989;&#25968;</span>
<span style="color: #F92672;">for</span> (i,j) <span style="color: #F92672;">in</span> (0..10).enumerate() {
    <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"i is </span><span style="color: #E6DB74; font-style: italic;">{}</span><span style="color: #E6DB74;">, j is </span><span style="color: #E6DB74; font-style: italic;">{}</span><span style="color: #E6DB74;">"</span>, i, j);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org13187a8" class="outline-3">
<h3 id="org13187a8">while</h3>
<div class="outline-text-3" id="text-org13187a8">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #75715E;">// </span><span style="color: #75715E;">expr&#26159;&#19968;&#20010;bool&#30340;&#34920;&#36798;&#24335;</span>
<span style="color: #F92672;">while</span> expr{

}

<span style="color: #75715E;">// </span><span style="color: #75715E;">loop&#31867;&#20284; while true</span>
<span style="color: #F92672;">loop</span> {

}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbeea5f2" class="outline-3">
<h3 id="orgbeea5f2">match</h3>
<div class="outline-text-3" id="text-orgbeea5f2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #75715E;">// </span><span style="color: #75715E;">match &#31867;&#27604;switch,&#38656;&#31526;&#21512;&#19968;&#19979;&#35201;&#27714;</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">1. &#35821;&#21477;&#20197;,&#32467;&#23614;</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">2. &#33509;&#35201;&#33719;&#21462;&#21305;&#37197;&#20540;&#65292;&#20351;&#29992;@&#31526;&#21495;,&#36890;&#24120;&#29992;&#20110;&#27169;&#24335;&#21305;&#37197;&#20013;</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">3. &#24517;&#39035;&#35201;&#26377;_&#31526;&#21512;&#26469;&#31351;&#20030;&#21097;&#20313;&#21305;&#37197;&#65292;&#22240;rust&#35201;&#27714;&#35206;&#30422;&#25152;&#26377;&#21487;&#33021;</span>
<span style="color: #F92672;">let</span> <span style="color: #F92672;">mut</span> <span style="color: #FD971F;">cnt</span> = 0;
<span style="color: #F92672;">match</span> cnt {
    0|6 =&gt; <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"ha"</span>),
    e @ 1 ... 5 =&gt; <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"hei"</span>),
    _ =&gt; <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"huhu"</span>),
}
<span style="color: #75715E;">// </span><span style="color: #75715E;">4. &#21487;&#36890;&#36807;ref&#20851;&#38190;&#23383;&#24471;&#21040;&#26576;&#20540;&#30340;&#24341;&#29992;</span>
<span style="color: #F92672;">match</span> cnt {
    <span style="color: #F92672;">ref</span> <span style="color: #FD971F;">r</span> =&gt; <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"got a ref </span><span style="color: #E6DB74; font-style: italic;">{}</span><span style="color: #E6DB74;">"</span>, r),
}
<span style="color: #75715E;">// </span><span style="color: #75715E;">5. &#21487;&#27169;&#31946;&#21305;&#37197;&#20803;&#32452;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">pair</span> = (0, -2);
<span style="color: #F92672;">match</span> pair {
    (0, y) =&gt; <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"y is </span><span style="color: #E6DB74; font-style: italic;">{:?}</span><span style="color: #E6DB74;">"</span>, y),
    (x, 0) =&gt; <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"x is </span><span style="color: #E6DB74; font-style: italic;">{:?}</span><span style="color: #E6DB74;">"</span>, x),
    _ =&gt; <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"doesnt match anything"</span>),
}
<span style="color: #75715E;">// </span><span style="color: #75715E;">6. &#21487;&#21305;&#37197;&#32467;&#26500;&#20307;,&#21450;&#26522;&#20030;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">origin</span> = <span style="color: #66D9EF;">Point</span> {<span style="color: #FD971F;">x</span>:0, <span style="color: #FD971F;">y</span>:0};
<span style="color: #F92672;">match</span> origin {
    <span style="color: #66D9EF;">Point</span>{x, ..} =&gt; <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"x is </span><span style="color: #E6DB74; font-style: italic;">{}</span><span style="color: #E6DB74;">"</span>, x),
}
<span style="color: #75715E;">// </span><span style="color: #75715E;">&#20063;&#21487;&#23545;struct&#20013;&#30340;&#22495;&#36827;&#34892;&#37325;&#21629;&#21517;</span>
<span style="color: #F92672;">match</span> origin {
    <span style="color: #66D9EF;">Point</span>{<span style="color: #FD971F;">x</span>:x1, <span style="color: #FD971F;">y</span>:y1} =&gt; <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"x is"</span>, x1),
}
<span style="color: #75715E;">// </span><span style="color: #75715E;">7. &#38500;&#20102;panic,&#25152;&#26377;&#20998;&#25903;&#30340;&#34920;&#36798;&#24335;&#30340;&#32467;&#26524;&#24517;&#39035;&#30456;&#21516;</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">&#21518;&#32622;&#26465;&#20214;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">y</span> = <span style="color: #F92672;">false</span>;
<span style="color: #F92672;">match</span> x {
    4|5 <span style="color: #F92672;">if</span> y =&gt; <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"yes"</span>), <span style="color: #75715E;">// </span><span style="color: #75715E;">&#20854;&#23454;&#23601;&#26159; (x in 4|5) &amp;&amp; (if y)</span>
    _ =&gt; <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"no"</span>),
}
<span style="color: #75715E;">// </span><span style="color: #75715E;">&#20854;&#23454;&#19978;&#36848;&#20869;&#23481;&#21644;haskell&#20013;&#30340;&#27169;&#24335;&#21305;&#37197;&#22522;&#26412;&#19968;&#26679;</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">&#20063;&#21487;&#36890;&#36807;let&#21644;while&#36827;&#34892;&#27169;&#24335;&#21305;&#37197;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">number</span> = <span style="color: #66D9EF;">Some</span>(7);
<span style="color: #F92672;">if</span> <span style="color: #F92672;">let</span> <span style="color: #66D9EF;">Some</span>(i) = number {
    <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"i is </span><span style="color: #E6DB74; font-style: italic;">{}</span><span style="color: #E6DB74;">"</span>, i);
} <span style="color: #F92672;">else</span> {
    <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"doesnt match a number"</span>);
}
<span style="color: #75715E;">// </span><span style="color: #75715E;">while let</span>
<span style="color: #F92672;">while</span> <span style="color: #F92672;">let</span> <span style="color: #66D9EF;">Some</span>(i) = number {
    <span style="color: #F92672;">if</span> i &gt; 5 {
        <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"i is gt 5"</span>);
        <span style="color: #F92672;">break</span>;
    } <span style="color: #F92672;">else</span> {
        <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"i is small than t"</span>);
    }
}
</pre>
</div>
</div>
</div>
</div>
