org/rust/rust学习笔记.org
* 函数
#+BEGIN_SRC rust
// fn 开头，可以多个参数，最多一个返回值
fn add_one(x: i32) -> i32 {
    // 若以;结尾，则返回()
    x + 1
}

// 但是可以利用元组来达到返回多个值的效果
fn get_two() -> (i32,i32){
    (1, 2)
}

// 发散函数，使用!作为返回类型,其实和golang的panic或者java的exception一个意思
fn diverging() -> !{
    panic!("this function will never return");
}
//发散函数返回值可以赋值给任何类型
fn test() -> i32{
    diverging()
}

// 函数也可以使用模式匹配
fn print_id((_, age):(&str, i32)) {
    println!("my age is {}",age);
}

// 若函数不加返回值，则其返回(), 即fn main() 和 fn main() -> () 是等价的。
fn main(){
    // 匿名函数
    // rust中的函数，最后一个表达式的值默认作为返回值。
    let plus_num = |x:i32| x+num;
}

// 使用impl关键字来为enum,struct等类型创建方法
struct Person {
    name :String,
}

impl Person {
    fn new(n: &str) -> Person{
        Person {
            name: n.to_string(),
        }
    }

    fn greeting (&self){
        println!("{} say hello.", self.name);
    }
}

// 函数作为一等公民，可通过type为某个函数类型定义别名
fn inc (n : i32) -> i32{
    n + 1
}
type IncType = fn(i32) -> i32;
let func: IncType = inc;
func(3);

// 函数作为返回值
fn get_func(n: i32) -> fn(i32) -> i32{
    // rust 支持在函数中定义函数，但是不能使用该函数外的变量，若要使用，则需要使用闭包
    fn inc(n:i32) -> i32{
        n+1
    }
    inc
}
#+END_SRC

* trait
类似golang的interface
#+BEGIN_SRC rust
trait HasArea {
    fn area(&self) -> f64;
}
// 实现
struct Circle {
    x: f64
}
#+END_SRC
* cargo
cargo为项目管理工具，类比java的maven,c++的cmake等。
cargo的默认规则:
- cargo.toml和cargo.lock文件总是位于项目根目录下。
- 源代码位于src目录下。
- 默认的库入口文件是src/lib.rs。
- 默认的可执行程序入口文件是src/main.rs。
- 其他可选的可执行文件位于src/bin/*.rs(这里每一个rs文件均对应一个可执行文件)。
- 外部测试源代码文件位于tests目录下。
- 示例程序源代码文件位于examples。
- 基准测试源代码文件位于benches目录下。
** cargo.toml和cargo.lock
开发只需关心cargo.toml不需要关心cargo.lock,cargo.toml中是项目依赖的信息及版本，可对该文件进行自定义的更改。
