rust/rust学习笔记.html
<div id="outline-container-org575fe24" class="outline-2">
<h2 id="org575fe24">函数</h2>
<div class="outline-text-2" id="text-org575fe24">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #75715E;">// </span><span style="color: #75715E;">fn &#24320;&#22836;&#65292;&#21487;&#20197;&#22810;&#20010;&#21442;&#25968;&#65292;&#26368;&#22810;&#19968;&#20010;&#36820;&#22238;&#20540;</span>
<span style="color: #F92672;">fn</span> <span style="color: #A6E22E;">add_one</span>(<span style="color: #FD971F;">x</span>: <span style="color: #66D9EF;">i32</span>) -&gt; <span style="color: #66D9EF;">i32</span> {
    <span style="color: #75715E;">// </span><span style="color: #75715E;">&#33509;&#20197;;&#32467;&#23614;&#65292;&#21017;&#36820;&#22238;()</span>
    x + 1
}

<span style="color: #75715E;">// </span><span style="color: #75715E;">&#20294;&#26159;&#21487;&#20197;&#21033;&#29992;&#20803;&#32452;&#26469;&#36798;&#21040;&#36820;&#22238;&#22810;&#20010;&#20540;&#30340;&#25928;&#26524;</span>
<span style="color: #F92672;">fn</span> <span style="color: #A6E22E;">get_two</span>() -&gt; (<span style="color: #66D9EF;">i32</span>,<span style="color: #66D9EF;">i32</span>){
    (1, 2)
}

<span style="color: #75715E;">// </span><span style="color: #75715E;">&#21457;&#25955;&#20989;&#25968;&#65292;&#20351;&#29992;!&#20316;&#20026;&#36820;&#22238;&#31867;&#22411;,&#20854;&#23454;&#21644;golang&#30340;panic&#25110;&#32773;java&#30340;exception&#19968;&#20010;&#24847;&#24605;</span>
<span style="color: #F92672;">fn</span> <span style="color: #A6E22E;">diverging</span>() -&gt; !{
    <span style="color: #F92672;">panic!</span>(<span style="color: #E6DB74;">"this function will never return"</span>);
}
<span style="color: #75715E;">//</span><span style="color: #75715E;">&#21457;&#25955;&#20989;&#25968;&#36820;&#22238;&#20540;&#21487;&#20197;&#36171;&#20540;&#32473;&#20219;&#20309;&#31867;&#22411;</span>
<span style="color: #F92672;">fn</span> <span style="color: #A6E22E;">test</span>() -&gt; <span style="color: #66D9EF;">i32</span>{
    diverging()
}

<span style="color: #75715E;">// </span><span style="color: #75715E;">&#20989;&#25968;&#20063;&#21487;&#20197;&#20351;&#29992;&#27169;&#24335;&#21305;&#37197;</span>
<span style="color: #F92672;">fn</span> <span style="color: #A6E22E;">print_id</span>((_, age):(&amp;<span style="color: #66D9EF;">str</span>, <span style="color: #66D9EF;">i32</span>)) {
    <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"my age is </span><span style="color: #E6DB74; font-style: italic;">{}</span><span style="color: #E6DB74;">"</span>,age);
}

<span style="color: #75715E;">// </span><span style="color: #75715E;">&#33509;&#20989;&#25968;&#19981;&#21152;&#36820;&#22238;&#20540;&#65292;&#21017;&#20854;&#36820;&#22238;(), &#21363;fn main() &#21644; fn main() -&gt; () &#26159;&#31561;&#20215;&#30340;&#12290;</span>
<span style="color: #F92672;">fn</span> <span style="color: #A6E22E;">main</span>(){
    <span style="color: #75715E;">// </span><span style="color: #75715E;">&#21311;&#21517;&#20989;&#25968;</span>
    <span style="color: #75715E;">// </span><span style="color: #75715E;">rust&#20013;&#30340;&#20989;&#25968;&#65292;&#26368;&#21518;&#19968;&#20010;&#34920;&#36798;&#24335;&#30340;&#20540;&#40664;&#35748;&#20316;&#20026;&#36820;&#22238;&#20540;&#12290;</span>
    <span style="color: #F92672;">let</span> <span style="color: #FD971F;">plus_num</span> = |<span style="color: #FD971F;">x</span>:<span style="color: #66D9EF;">i32</span>| x+num;
}

<span style="color: #75715E;">// </span><span style="color: #75715E;">&#20351;&#29992;impl&#20851;&#38190;&#23383;&#26469;&#20026;enum,struct&#31561;&#31867;&#22411;&#21019;&#24314;&#26041;&#27861;</span>
<span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">Person</span> {
    name :<span style="color: #66D9EF;">String</span>,
}

<span style="color: #F92672;">impl</span> <span style="color: #66D9EF;">Person</span> {
    <span style="color: #F92672;">fn</span> <span style="color: #A6E22E;">new</span>(<span style="color: #FD971F;">n</span>: &amp;<span style="color: #66D9EF;">str</span>) -&gt; <span style="color: #66D9EF;">Person</span>{
        <span style="color: #66D9EF;">Person</span> {
            <span style="color: #FD971F;">name</span>: n.to_string(),
        }
    }

    <span style="color: #F92672;">fn</span> <span style="color: #A6E22E;">greeting</span> (&amp;<span style="color: #F92672;">self</span>){
        <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"</span><span style="color: #E6DB74; font-style: italic;">{}</span><span style="color: #E6DB74;"> say hello."</span>, <span style="color: #F92672;">self</span>.name);
    }
}

<span style="color: #75715E;">// </span><span style="color: #75715E;">&#20989;&#25968;&#20316;&#20026;&#19968;&#31561;&#20844;&#27665;&#65292;&#21487;&#36890;&#36807;type&#20026;&#26576;&#20010;&#20989;&#25968;&#31867;&#22411;&#23450;&#20041;&#21035;&#21517;</span>
<span style="color: #F92672;">fn</span> <span style="color: #A6E22E;">inc</span> (n : <span style="color: #66D9EF;">i32</span>) -&gt; <span style="color: #66D9EF;">i32</span>{
    n + 1
}
<span style="color: #F92672;">type</span> <span style="color: #66D9EF;">IncType</span> = <span style="color: #F92672;">fn</span>(<span style="color: #66D9EF;">i32</span>) -&gt; <span style="color: #66D9EF;">i32</span>;
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">func</span>: <span style="color: #66D9EF;">IncType</span> = inc;
func(3);

<span style="color: #75715E;">// </span><span style="color: #75715E;">&#20989;&#25968;&#20316;&#20026;&#36820;&#22238;&#20540;</span>
<span style="color: #F92672;">fn</span> <span style="color: #A6E22E;">get_func</span>(<span style="color: #FD971F;">n</span>: <span style="color: #66D9EF;">i32</span>) -&gt; <span style="color: #F92672;">fn</span>(<span style="color: #66D9EF;">i32</span>) -&gt; <span style="color: #66D9EF;">i32</span>{
    <span style="color: #75715E;">// </span><span style="color: #75715E;">rust &#25903;&#25345;&#22312;&#20989;&#25968;&#20013;&#23450;&#20041;&#20989;&#25968;&#65292;&#20294;&#26159;&#19981;&#33021;&#20351;&#29992;&#35813;&#20989;&#25968;&#22806;&#30340;&#21464;&#37327;&#65292;&#33509;&#35201;&#20351;&#29992;&#65292;&#21017;&#38656;&#35201;&#20351;&#29992;&#38381;&#21253;</span>
    <span style="color: #F92672;">fn</span> <span style="color: #A6E22E;">inc</span>(<span style="color: #FD971F;">n</span>:<span style="color: #66D9EF;">i32</span>) -&gt; <span style="color: #66D9EF;">i32</span>{
        n+1
    }
    inc
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad713e8" class="outline-2">
<h2 id="orgad713e8">trait</h2>
<div class="outline-text-2" id="text-orgad713e8">
<p>
类似golang的interface
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #F92672;">trait</span> <span style="color: #66D9EF;">HasArea</span> {
    <span style="color: #F92672;">fn</span> <span style="color: #A6E22E;">area</span>(&amp;<span style="color: #F92672;">self</span>) -&gt; <span style="color: #66D9EF;">f64</span>;
}
<span style="color: #75715E;">// </span><span style="color: #75715E;">&#23454;&#29616;</span>
<span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">Circle</span> {
    <span style="color: #FD971F;">x</span>: <span style="color: #66D9EF;">f64</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org5198671" class="outline-2">
<h2 id="org5198671">cargo</h2>
<div class="outline-text-2" id="text-org5198671">
<p>
cargo为项目管理工具，类比java的maven,c++的cmake等。
cargo的默认规则:
</p>
<ul class="org-ul">
<li>cargo.toml和cargo.lock文件总是位于项目根目录下。</li>
<li>源代码位于src目录下。</li>
<li>默认的库入口文件是src/lib.rs。</li>
<li>默认的可执行程序入口文件是src/main.rs。</li>
<li>其他可选的可执行文件位于src/bin/*.rs(这里每一个rs文件均对应一个可执行文件)。</li>
<li>外部测试源代码文件位于tests目录下。</li>
<li>示例程序源代码文件位于examples。</li>
<li>基准测试源代码文件位于benches目录下。</li>
</ul>
</div>
<div id="outline-container-org6b43412" class="outline-3">
<h3 id="org6b43412">cargo.toml和cargo.lock</h3>
<div class="outline-text-3" id="text-org6b43412">
<p>
开发只需关心cargo.toml不需要关心cargo.lock,cargo.toml中是项目依赖的信息及版本，可对该文件进行自定义的更改。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: qxg</p>
<p class="date">Created: 2019-04-17 Wed 17:09</p>
<p class="validation"></p>
</div>
</body>
</html>
